In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('./salaries_by_college_major.csv')

In [4]:
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

# 판다스를 이용한 예비 데이터 탐색 및 데이터 정리

- 데이터프레임에는 몇 개의 행이 있나?
- 몇 개의 열이 있나?
- 열의 레이블은 무엇인가? 열에 이름이 있나?
- 데이터프레임에 누락된 값이 있나? 데이터프레임에 잘못된 데이터가 포함되어 있지 않나?

In [5]:
df.shape

(51, 6)

In [6]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

## 결측값 및 정크 데이터

In [7]:
df.isna()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
5,False,False,False,False,False,False
6,False,False,False,False,False,False
7,False,False,False,False,False,False
8,False,False,False,False,False,False
9,False,False,False,False,False,False
10,False,False,False,False,False,False
11,False,False,False,False,False,False
12,False,False,False,False,False,False
13,False,False,False,False,False,False
14,False,False,False,False,False,False
15,False,False,False,False,False,False
16,False,False,False,False,False,False
17,False,False,False,False,False,False
18,False,False,False,False,False,False
19,False,False,False,False,False,False
20,False,False,False,False,False,False
21,False,False,False,False,False,False
22,False,False,False,False,False,False
23,False,False,False,False,False,False
24,False,False,False,False,False,False
25,False,False,False,False,False,False
26,False,False,False,False,False,False
27,False,False,False,False,False,False
28,False,False,False,False,False,False
29,False,False,False,False,False,False
30,False,False,False,False,False,False
31,False,False,False,False,False,False
32,False,False,False,False,False,False
33,False,False,False,False,False,False
34,False,False,False,False,False,False
35,False,False,False,False,False,False
36,False,False,False,False,False,False
37,False,False,False,False,False,False
38,False,False,False,False,False,False
39,False,False,False,False,False,False
40,False,False,False,False,False,False
41,False,False,False,False,False,False
42,False,False,False,False,False,False
43,False,False,False,False,False,False
44,False,False,False,False,False,False
45,False,False,False,False,False,False
46,False,False,False,False,False,False
47,False,False,False,False,False,False
48,False,False,False,False,False,False
49,False,False,False,False,False,False
50,False,True,True,True,True,True

In [9]:
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [10]:
# 마지막 행 삭제
clean_df = df.dropna()

In [11]:
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

# 데이터프레임에 있는 열 및 개별 셀에 접근하기

In [12]:
# 초봉이 가장 높은 대학 전공 찾기
clean_df['Starting Median Salary']

0     46000.0
1     57700.0
2     42600.0
3     36800.0
4     41600.0
5     35800.0
6     38800.0
7     43000.0
8     63200.0
9     42600.0
10    53900.0
11    38100.0
12    61400.0
13    55900.0
14    53700.0
15    35000.0
16    35900.0
17    50100.0
18    34900.0
19    60900.0
20    38000.0
21    37900.0
22    47900.0
23    39100.0
24    41200.0
25    43500.0
26    35700.0
27    38800.0
28    39200.0
29    37800.0
30    57700.0
31    49100.0
32    36100.0
33    40900.0
34    35600.0
35    49200.0
36    40800.0
37    45400.0
38    57900.0
39    35900.0
40    54200.0
41    39900.0
42    39900.0
43    74300.0
44    50300.0
45    40800.0
46    35900.0
47    34100.0
48    36500.0
49    34000.0
Name: Starting Median Salary, dtype: float64

In [13]:
clean_df['Starting Median Salary'].max()

74300.0

In [14]:
# 메소드가 가장 큰 값을 가진 행에 대한 인덱스 제공
clean_df['Starting Median Salary'].idxmax()

43

In [15]:
# 특정 행에 해당하는 전공 이름
clean_df['Undergraduate Major'].loc[43]

'Physician Assistant'

In [17]:
clean_df['Undergraduate Major'][43]

'Physician Assistant'

In [18]:
clean_df.loc[43]

Undergraduate Major                  Physician Assistant
Starting Median Salary                           74300.0
Mid-Career Median Salary                         91700.0
Mid-Career 10th Percentile Salary                66400.0
Mid-Career 90th Percentile Salary               124000.0
Group                                               STEM
Name: 43, dtype: object

## 도전

(1) 중간 경력 봉급이 가장 높은 대학 전공은? 이 전공 졸업생들은 얼마를 벌까? (중간 경력은 10년 이상의 경력으로 정의합니다.)

In [20]:
clean_df['Mid-Career Median Salary'].idxmax()

8

In [21]:
clean_df.loc[8]

Undergraduate Major                  Chemical Engineering
Starting Median Salary                            63200.0
Mid-Career Median Salary                         107000.0
Mid-Career 10th Percentile Salary                 71900.0
Mid-Career 90th Percentile Salary                194000.0
Group                                                STEM
Name: 8, dtype: object

(2)초봉이 가장 낮은 대학 전공은 무엇이며 졸업 후 졸업생은 얼마를 벌까?

In [22]:
clean_df['Starting Median Salary'].idxmin()

49

In [23]:
clean_df.loc[49]

Undergraduate Major                  Spanish
Starting Median Salary               34000.0
Mid-Career Median Salary             53100.0
Mid-Career 10th Percentile Salary    31000.0
Mid-Career 90th Percentile Salary    96400.0
Group                                   HASS
Name: 49, dtype: object

(3)중간 경력 봉급이 가장 낮은 대학 전공은 무엇이며 이 학위로 얼마를 벌 수 있을까?

In [24]:
clean_df['Mid-Career Median Salary'].idxmin()

18

In [25]:
clean_df.loc[18]

Undergraduate Major                  Education
Starting Median Salary                 34900.0
Mid-Career Median Salary               52000.0
Mid-Career 10th Percentile Salary      29300.0
Mid-Career 90th Percentile Salary     102000.0
Group                                     HASS
Name: 18, dtype: object

# 값 분류 및 열 추가하기 : 잠재력이 가장 큰 전공 대 위험도가 가장 낮은 전공

위험도가 가장 낮은 전공
- 10번째 백분위수와 90번째 백분위수 소득의 차이가 작으면 위험도 낮음

In [26]:
clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']

0     109800.0
1      96700.0
2     113700.0
3     104200.0
4      85400.0
5      96200.0
6      98100.0
7     108200.0
8     122100.0
9     102700.0
10     84600.0
11    105500.0
12     95900.0
13     98000.0
14    114700.0
15     74800.0
16    116300.0
17    159400.0
18     72700.0
19     98700.0
20     99600.0
21    102100.0
22    147800.0
23     70000.0
24     92000.0
25    111000.0
26     76000.0
27     66400.0
28    112000.0
29     88500.0
30    115900.0
31     84500.0
32     71300.0
33    118800.0
34    106600.0
35    100700.0
36    132900.0
37    137800.0
38     99300.0
39    107300.0
40     50700.0
41     65300.0
42    132500.0
43     57600.0
44    122000.0
45    126800.0
46     95400.0
47     66700.0
48     87300.0
49     65400.0
dtype: float64

In [27]:
clean_df['Mid-Career 90th Percentile Salary'].subtract(clean_df['Mid-Career 10th Percentile Salary'])

0     109800.0
1      96700.0
2     113700.0
3     104200.0
4      85400.0
5      96200.0
6      98100.0
7     108200.0
8     122100.0
9     102700.0
10     84600.0
11    105500.0
12     95900.0
13     98000.0
14    114700.0
15     74800.0
16    116300.0
17    159400.0
18     72700.0
19     98700.0
20     99600.0
21    102100.0
22    147800.0
23     70000.0
24     92000.0
25    111000.0
26     76000.0
27     66400.0
28    112000.0
29     88500.0
30    115900.0
31     84500.0
32     71300.0
33    118800.0
34    106600.0
35    100700.0
36    132900.0
37    137800.0
38     99300.0
39    107300.0
40     50700.0
41     65300.0
42    132500.0
43     57600.0
44    122000.0
45    126800.0
46     95400.0
47     66700.0
48     87300.0
49     65400.0
dtype: float64

In [30]:
spread_col = clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
clean_df.insert(1, 'Spread', spread_col)
clean_df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

In [32]:
# 가장 낮은 분포로 정렬
low_risk = clean_df.sort_values('Spread')
low_risk[['Undergraduate Major', 'Spread']].head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

## 도전

(1).sort_values() 메소드를 사용하여 잠재력이 가장 높은 학위 찾기
(90번째 백분위수에서 가장 높은 값을 가진 상위 5 학위 찾기)

In [33]:
potential = clean_df.sort_values('Mid-Career 90th Percentile Salary', ascending = False)
potential.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
17,Economics,159400.0,50100.0,98600.0,50600.0,210000.0,Business
22,Finance,147800.0,47900.0,88300.0,47200.0,195000.0,Business
8,Chemical Engineering,122100.0,63200.0,107000.0,71900.0,194000.0,STEM
37,Math,137800.0,45400.0,92400.0,45200.0,183000.0,STEM
44,Physics,122000.0,50300.0,97300.0,56000.0,178000.0,STEM

(2) 급여에서 가장 큰 분포를 보이는 학위 찾기. 졸업 후 고소득자와 저소득자 사이 소득 차이가 가장 큰 전공은 무엇일까?

In [37]:
clean_df['Spread'].idxmax()

17

In [38]:
clean_df.loc[17]

Undergraduate Major                  Economics
Spread                                159400.0
Starting Median Salary                 50100.0
Mid-Career Median Salary               98600.0
Mid-Career 10th Percentile Salary      50600.0
Mid-Career 90th Percentile Salary     210000.0
Group                                 Business
Name: 17, dtype: object

정답

In [39]:
highest_spread = clean_df.sort_values('Spread', ascending = False)
highest_spread[['Undergraduate Major', 'Spread']].head()

   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

In [40]:
potential[['Undergraduate Major', 'Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

In [41]:
highest_spread = clean_df.sort_values('Mid-Career Median Salary', ascending = False)
highest_spread[['Undergraduate Major', 'Mid-Career Median Salary']].head()

       Undergraduate Major  Mid-Career Median Salary
8     Chemical Engineering                  107000.0
12    Computer Engineering                  105000.0
19  Electrical Engineering                  103000.0
1    Aerospace Engineering                  101000.0
17               Economics                   98600.0

경제학 학위자 중에 몇몇은 소득이 매우 높지만, 그만큼 많지 않은 사람들도 있다는 것을 의미. 중간 봉급이 매우 높은 학위를 이 두 순위와 비교하는 것은 매우 흥미롭다.

# 판다스를 이용한 그룹화 및 피벗

In [44]:
clean_df.groupby('Group').count()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,12,12,12,12,12,12
HASS,22,22,22,22,22,22
STEM,16,16,16,16,16,16

In [47]:
clean_df['Undergraduate Major'] = pd.to_numeric(clean_df['Undergraduate Major'], errors='coerce')

C:\Users\LG\AppData\Local\Temp\ipykernel_4032\3763613077.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  clean_df['Undergraduate Major'] = pd.to_numeric(clean_df['Undergraduate Major'], errors='coerce')

In [48]:
# 그룹별 평균 봉급
clean_df.groupby('Group').mean()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,NaN,103958.333333,44633.333333,75083.333333,43566.666667,147525.000000
HASS,NaN,95218.181818,37186.363636,62968.181818,34145.454545,129363.636364
STEM,NaN,101600.000000,53862.500000,90812.500000,56025.000000,157625.000000

사용자님께서 제시한 오류는 TypeError: agg function failed [how->mean,dtype->object]로, 이는 df.groupby('학교').mean() 실행 시 ‘학교’를 기준으로 그룹화한 뒤 평균을 계산하고자 할 때 특정 컬럼의 데이터 타입이 숫자형이 아닌 ‘object’ 형태로 인식되어 발생한 문제입니다. Pandas에서 ‘object’ 데이터 타입은 대개 문자열을 의미하며, 이러한 컬럼에 대해 평균(mean)과 같은 수치 연산을 진행할 수 없습니다.

해당 오류를 해결하기 위해서는 숫자로 변환 가능한 컬럼만 선택하거나, 혹은 문자열로 인식될 수 있는 컬럼을 제외하고 숫자형 컬럼에 대해서만 평균을 계산해야 합니다. 만약 ‘NaN’ 값으로 인해 숫자형 컬럼이 문자열로 인식되는 경우, 해당 컬럼을 숫자형으로 명시적으로 변환해주어야 합니다. 예를 들어, pandas의 to_numeric 함수를 사용해 변환을 시도할 수 있습니다.

errors='coerce' 옵션은 변환할 수 없는 값을 NaN으로 설정하기 때문에 수치 연산이 가능해집니다. 모든 컬럼에 대해 해당 작업을 수행한 후 평균을 다시 계산해 보세요.

In [49]:
# 출력에서 숫자 형식
pd.options.display.float_format = '{:,.2f}'.format

In [50]:
clean_df.groupby('Group').mean()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,NaN,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,NaN,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,NaN,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"

## 추가 점수

이 강의에서 사용한 페이스케일 데이터셋은 2008년 자료이며, 이전 10년에 대한 것입니다. 당시 재정학이 학위 후 수입에서 어떻게 이런 높은 순위를 차지했을까요. 하지만 우리 모두는 그 해에 막대한 재정적 위기가 있었다는 것을 알고 있죠. 아마도 상황은 그때와 같지 않을 거에요. 이전 강의(예를 들어 45일차)에서 웹 스크래핑에 대해 배운 것을 사용하여 아래 코멘트에 있는 페이스케일웹사이트에서 변경된 정보를 공유해줄 수 있나요?

https://www.payscale.com/college-salary-report/majors-that-pay-you-back/bachelors

# 핵심 학습내용 및 요약

· .head(), .tail(), .shape, .columns를 사용하여 데이터프레임을 탐색하고 행과 열의 개수 및 열의 이름을 찾아보세요.

· .findna()를 이용하여 NaN(not a number, 숫자 아님) 값을 찾아보고 .dropna()를 이용하여 데이터프레임을 정리하려면 어떻게 할지 생각해 보세요.

· [] 표기를 이용하여 df['column name'] 또는 df[['column name 1', 'column name 2', 'column name 3']]으로 데이터프레임의 전체 열에 접근할 수 있습니다.

· df['column name'][index]와 같이 []을 연결하거나 df['column name'].loc[index]을 사용하여 데이터프레임에 있는 개별 셀에 접근할 수 있습니다.

· 최대값과 최소값 그리고 각각의 위치는 .max(), .min(), .idxmax() 그리고 .idxmin()과 같은 메소드로 찾을 수 있습니다.

· .sort_values()로 데이터프레임을 분류하고 .insert()로 새로운 열을 추가할 수 있습니다.

· 특정 범주에 속하는 항목을 그룹화하여 엑셀 스타일 피벗 테이블을 생성하려면 .groupby() 메소드를 사용해 주세요.